[
  {
    "id": 1,
    "company": "Rimal Int'l Adv. & Co., U.A.E",
    "title": "Web/UI Designer",
    "type": "Full time",
    "year": "2021-2023",
    "desc": [
      "Developed an efficient and maintainable code using HTML, CSS, and JavaScript, adhering to best practices.",
      "Created new features, functionalities, and capabilities on the site using HTML, CSS, WordPress, and JavaScript, Tailwind CSS.",
      "Designing and implementing HTML email templates and newsletter for marketing campaigns",
      "Striking a balance between functional and aesthetic design.",
      "Optimizing web pages for maximum speed and scalability."
    ]
  },
  {
    "id": 2,
    "company": "Sprout Digital",
    "title": "Web/UI Developer",
    "type": "Full time",
    "year": "2018-2020",
    "desc": [
      "Collaborated with the team to design, structure, and develop new web applications from start to finish using HTML, TailwindCSS, CSS, and WordPress.",
      "Performed periodic update on existing websites.",
      "Created website layout and user interface using standard HTML, CSS & JavaScript practices.",
      "Created new features, functionalities, and capabilities on the site using HTML, CSS, WordPress, and JavaScript.",
      "Implemented designs from Figma and built robust user interfaces with great user experience.",
      "Optimizing web pages for maximum speed and scalability.",
      "Ensure the technical feasibility of UI/UX designs.",
      "Collaborated with product team members to implement new feature developments."
    ]
  },

  {
    "id": 3,
    "company": "codeITng.",
    "title": "Instructional Facilitator ",
    "type": "Volunteered",
    "year": "2018-2019",
    "about": "About codeIT: codeIT is one of the many innovations hosted by YouthHubAfrica and organized by Sprout Digital. It’s dedicated to growing young people in the area of computer science and tech, especially around promoting hardcore programming skills at an early age.",
    "desc": [
      "Volunteered as an animation and coding facilitator for kids under the age of 5 - 18 years during their summer holidays."
    ]
  },
  {
    "id": 4,
    "company": "YouthhubAfrica.",
    "title": "Creative Designer - ",
    "type": "Volunteered",
    "year": "Oct 2019-Dec 2019",
    "about": "Youth Foundation for Development, Education & Leadership (YouthhubAfrica) is a non-profit organization founded in 2011. YouthhubAfrica is a platform for young people in Africa involved in social change to interact, learn and collaborate in new, creative and easy ways.",
    "desc": [
      "Volunteered as part of a multimedia team that managed the publicity of a yearly conference organized by YouthhubAfrica."
    ]
  }
]
